export var plot = {
  1: {
    type: "story",
    text: "传说，在大海某处有一座岛。",
    goto: 2,
  },
  2: {
    type: "story",
    text: "岛上的女子为了将美丽承远定格，会在人生最美的时刻化为石像。",
    goto: 3,
  },
  3: {
    type: "story",
    text: "那座岛也许有自己的名字，但在传说中它被称作“石岛”。",
    goto: 4,
  },
  4: {
    type: "story",
    text: "弟弟的大笑阻止了姐姐的思考：“没想到你现在还会相信这些无趣的传说。”",
    goto: "5",
  },
  5: {
    type: "story",
    text: "姐姐已经习惯了人们的嘲笑，调查石岛这几年，任何一个人都是这样的态度。",
    goto: 6,
  },
  6: {
    type: "story",
    text: "他们嘴里虽然时常说起石岛，但没有一个人真正相信它存在。",
    goto: 7,
  },
  7: {
    type: "story",
    text: "姐姐摆出一张地图：“我已经推算出石岛的大致位置了。”",
    goto: 8,
  },
  8: {
    type: "story",
    text: "“但那只是个传说而已。”",
    goto: 9,
  },
  9: {
    type: "story",
    text: "笑声正要加剧，姐姐晃动手里的船钥匙将笑声噎住。",
    goto: 10,
  },
  10: {
    type: "story",
    text: "“父母已经同意了我的请求。”",
    goto: 11,
  },
  11: {
    type: "story",
    text: "弟弟难以置信，姐姐很是得意。",
    goto: 12,
  },
  12: {
    type: "story",
    text: "“我马上就要出海去找石岛。”",
    goto: 13,
  },
  13: {
    type: "option",
    text: "[A]我不相信父母会同意!  [B]你或许需要一位助手",
    options: [
      ["A", "我不相信父母会同意"],
      ["B", "你或许需要一位助手"],
    ],
    goto: [14, 13.1],
  },
  14: {
    type: "story",
    text: "直到晚餐时，你仍在念叨着这句话。",
    goto: 15,
  },
  13.1: {
    type: "story",
    text: "你不想找石岛，但你想出海。于是态度立刻一百八十度大转变，求着姐姐带上你。",
    goto: 13.2,
  },
  13.2: {
    type: "story",
    text: "姐姐终于掌握住了你，随之而来的就是报复。她故作思考状，在你好话说尽后却来了句...看你表现!",
    goto: 13.3,
  },
  13.3: {
    type: "story",
    text: "你将之前的好话尽数收回，同时放言要在父母面前罗列出其中危险。",
    goto: 15,
  },
  15: {
    type: "story",
    text: "“没事，去吧。尽管我们也很担心，但这是她想要做的事，我们没必要阻止。而且，我相信她有处理危机的能力，说不定真能找到石岛呢。”",
    goto: 16,
  },
  16: {
    type: "story",
    text: "父母二人喝着茶，看着你和姐姐，表情平静。",
    goto: 17,
  },
  17: {
    type: "story",
    text: "尽管不想这么说，但你确实无法质疑姐姐的能力。不过你仍有疑惑，姐姐的船哪来的。你们虽然住在海边，但父亲确是做手工生意。",
    goto: 18,
  },
  18: {
    type: "story",
    text: "父母说：“其实我们家有条船，不过有几十年没用过了。”",
    goto: 19,
  },
  19: {
    type: "story",
    text: "直到今天你才知道，这条已经与沙滩融合，几乎被你当作沙滩的一部分、从小无视到大的废船，就是家里的船。 ",
    goto: 20,
  },
  20: {
    type: "story",
    text: "经过一番修修补补，老船时隔几十年后再次下水。",
    goto: 21,
  },
  21: {
    type: "story",
    text: "姐姐站在船上，你和父母站在岸上。",
    goto: 22,
  },
  22: {
    type: "story",
    text: "姐姐冲你喊：“要不要来给我当助手?”",
    goto: 23,
  },
  23: {
    type: "option",
    text: "[A]要  [B]不要",
    options: [
      ["A", "我不相信父母会同意"],
      ["B", "你或许需要一位助手"],
    ],
    goto: [24, 23.1],
  },
  23.1: {
    type: "story",
    text: "当你发现姐姐是认真的之后，你觉得自己还是不要跟去添乱了。",
    goto: 23.2,
  },
  23.2: {
    type: "story",
    text: "而在姐姐离开后，一家人的生活依旧如常。",
    goto: 23.3,
  },
  23.3: {
    type: "story",
    text: "吃饭，工作，钓鱼，参加父亲的竣工仪式..",
    goto: 23.4,
  },
  23.4: {
    type: "story",
    text: "一切都和往常一样，但你发现家里每个人都在牵挂着姐姐。",
    goto: 23.5,
  },
  23.5: {
    type: "story",
    text: "End 1: Happy end.",
    goto: "0",
  },
  24: {
    type: "story",
    text: "你毫不犹豫接受了邀请。",
    goto: 25,
  },
  25: {
    type: "story",
    text: "在这一个月之内，你见证了两个奇迹，一个是那条废船竟还能修好。",
    goto: 26,
  },
  26: {
    type: "story",
    text: "另一个是你们在遭遇一场风暴导致航线偏离之后，真的发现了石岛。",
    goto: 27,
  },
  27: {
    type: "story",
    text: "风暴过后，眼前只剩两种分离的蓝，而在这交界处，出现了一个让你难以置信的黑点。",
    goto: 28,
  },
  28: {
    type: "story",
    text: "姐姐用望远镜观察后激动地宣布：“我们发现了石岛。”",
    goto: 29,
  },
  29: {
    type: "story",
    text: "在望远镜中你看到海滩上立着一排石像。",
    goto: 30,
  },
  30: {
    type: "story",
    text: "登岛后，近距离观察，你们皆被震惊的说不出话..",
    goto: 31,
  },
  31: {
    type: "story",
    text: "此刻你即使再不肯相信，你也不得不承认，这就是传说中的石岛。",
    goto: 32,
  },
  32: {
    type: "story",
    text: "正如传说中那样，这些石像都太真实了。",
    goto: 33,
  },
  33: {
    type: "story",
    text: "你们在这石像上看到的不止有美，还有女子变成石像前的那抹恐惧，那最后一刻一切属于人的细微情绪都被定格。",
    goto: 34,
  },
  34: {
    type: "story",
    text: "你可以笃定再高超的雕刻家也无法还原，这是只有人才拥有的东西。毫无疑问，这些石像曾经就是活生生的人。",
    goto: 35,
  },
  35: {
    type: "story",
    text: "顺着道路往石岛深处走，你们看到了更多的石像。她们摆着各种呈现美好的资势，但所有石像都带着一抹恐俱或不舍。",
    goto: 36,
  },
  36: {
    type: "story",
    text: "姐姐审视着这一切，她自言自语：“为了将美丽永远定格所以变成石像，可这些石像美丽吗？”",
    goto: 37,
  },
  37: {
    type: "option",
    text: "[A]美  [B]不美",
    options: [
      ["A", "美"],
      ["B", "不美"],
    ],
    goto: [38.1, 37.1],
  },
  37.1: {
    type: "story",
    text: "你摇头：“我只看到了她们变成石像前的恐惧和不舍。",
    goto: 39,
  },
  38.1: {
    type: "story",
    text: "你点头：“毫无疑问，它们是美的，没有比这更还原的石像。",
    goto: 38.2,
  },
  38.2: {
    type: "story",
    text: "但作为人，我们不止能看到，我们还能思考。而这些石像所传进出的信息，怎样都不能用美来形容。",
    goto: 39,
  },
  39: {
    type: "story",
    text: "她们在最美的时候停留，但留下的却不是美好。”",
    goto: 40,
  },
  40: {
    type: "story",
    text: "姐姐问你：“你认为什么时候是最美的时候?”",
    goto: 41,
  },
  41: {
    type: "option",
    text: "[A]恋爱时  [B]拥有成就时",
    options: [
      ["A", "恋爱时"],
      ["B", "拥有成就时"],
    ],
    goto: [42.1, 43.1],
  },
  42.1: {
    type: "story",
    text: "你思索一阵，试探着回答：“恋爱时吗?”",
    goto: 44,
  },
  43.1: {
    type: "story",
    text: "你思索一阵，试探着回答：“拥有成就时吗?”",
    goto: 44,
  },
  44: {
    type: "story",
    text: "“无论是在恋爱时或是获得成就时。最美的时候一定是她们对自己最满意最自信的时候，谁又能在这时候毫不留恋地结束生命呢。”",
    goto: 45,
  },
  45: {
    type: "story",
    text: "姐姐环顾着周围那一张张精致的面孔...",
    goto: 46,
  },
  46: {
    type: "story",
    text: "“所以石岛注定不会出现美丽的石像。”",
    goto: 47,
  },
  47: {
    type: "story",
    text: "你们抱着同情和感慨，浏览着每个石像。",
    goto: 48,
  },
  48: {
    type: "story",
    text: "在广场一个角落，你们却停下了脚步，姐姐的推论很快被打破。因为你们看到了一个真正美丽的石像，从它身上你们再看不到恐惧或不舍，只看到了纯粹的美好。",
    goto: 49,
  },
  49: {
    type: "story",
    text: "“这是岛上最美的石像。”不知什么时候一位老阿婆出现在身后。",
    goto: 50,
  },
  50: {
    type: "story",
    text: "经过她一番自来熟的介绍，你们得知岛上仍有不少居民...",
    goto: 51,
  },
  51: {
    type: "story",
    text: "而老阿婆是其中年龄最大的一个，她从未觉得自己美丽所以一直生活到现在。",
    goto: 52,
  },
  52: {
    type: "option",
    text: "[A]先走为妙  [B]小心试探",
    options: [
      ["A", "先走为妙"],
      ["B", "小心试探"],
    ],
    goto: [53.1, 54.1],
  },
  53.1: {
    type: "story",
    text: "你小声对姐姐说：“我们还是先走为妙，小心被变成石像！” 你们等待着时机，老阿婆却已经看穿你们的心思。",
    goto: 53.2,
  },
  53.2: {
    type: "story",
    text: "“除非自己愿意，没人能把你们变成石像。”",
    goto: 55,
  },
  54.1: {
    type: "story",
    text: "你问：“附近还有别人吗？”",
    goto: 54.2,
  },
  54.2: {
    type: "story",
    text: "老阿婆摇头。",
    goto: 54.3,
  },
  54.3: {
    type: "story",
    text: "你又问：“你们拥有让别人变成石像的能力吗?”",
    goto: 54.4,
  },
  54.4: {
    type: "story",
    text: "你的意图似乎太明显了，对方直接说：",
    goto: 54.5,
  },
  54.5: {
    type: "story",
    text: "“除非自己愿意，没人能把你们变成石像。”她看向周围：“这里所有人都是自愿变成石像的。”",
    goto: 55,
  },
  55: {
    type: "story",
    text: "姐姐说：“说是自愿，但更多的是世俗传统的无形逼迫。”",
    goto: 56,
  },
  56: {
    type: "story",
    text: "老阿婆说： “确实如此， 我一直生活到现在，比你们更懂其中的压力。我只是想告诉你们，没人会伤害你们，而且除我之外，平常很少有人来这，所以你们也不必急着逃走。”",
    goto: 57,
  },
  57: {
    type: "story",
    text: "老阿婆抚摸着这尊石像：“我可以给你们讲讲这尊最美的石像的故事。”",
    goto: 58,
  },
  58: {
    type: "story",
    text: "看你们仍在犹豫，她又说：“遇到我算你们走运，我可是岛上唯一个见过石化过程的人。’",
    goto: 59,
  },
  59: {
    type: "story",
    text: "听到这句，你们的兴趣立刻被提了起来。",
    goto: 60,
  },
  60: {
    type: "story",
    text: "#####\n女孩坐在悬崖边看着大海。 ",
    goto: 61,
  },
  61: {
    type: "story",
    text: "男孩喊着她的名字焦急地找了过来。看到女孩后，他终于放心。两人一起坐在悬崖边。夕阳洒在岛屿上，酒在女孩身上。男孩掏出纸和笔描绘着女孩此刻的模样。",
    goto: 62,
  },
  62: {
    type: "story",
    text: "女孩发现了对方的举动，她问男孩：“你觉得我漂亮吗？”",
    goto: 63,
  },
  63: {
    type: "option",
    text: "[A]漂亮  [B]沉默",
    options: [
      ["A", "漂亮"],
      ["B", "沉默"],
    ],
    goto: [64.1, 65.1],
  },
  64.1: {
    type: "story",
    text: "男孩停下了笔，诚恳地点头。",
    goto: 64.2,
  },
  64.2: {
    type: "story",
    text: "但女孩却没有因为夸奖而高兴，她低下了头，原本活力的面庞也被愁容覆盖...",
    goto: 64.3,
  },
  64.3: {
    type: "option",
    text: "[A]“你非常漂亮。”  [B]“你人生的任何阶段都会很美。”",
    options: [
      ["A", "“你非常漂亮。”"],
      ["B", "“你人生的任何阶段都会很美。”"],
    ],
    goto: [64.41, 64.51],
  },
  64.41: {
    type: "story",
    text: "男孩继续称赞女孩：“你非常漂亮！”",
    goto: 64.42,
  },
  64.42: {
    type: "story",
    text: "女孩的声音毫无生气：“你说的没错，我现在确实非常漂亮。”",
    goto: 64.43,
  },
  64.43: {
    type: "story",
    text: "她说完这句话就走了。",
    goto: 64.44,
  },
  64.44: {
    type: "story",
    text: "几天后，石岛上又多了一尊石像，她同其它石像一样，带着恐惧和不舍。",
    goto: 64.45,
  },
  64.45: {
    type: "story",
    text: "End 2 (BE)",
    goto: "0",
  },
  64.51: {
    type: "story",
    text: "在石岛上夸奖一个人美往往带着另一种含义。",
    goto: 64.52,
  },
  64.52: {
    type: "story",
    text: "但两人相互爱着彼此，毫无疑问在男孩眼中，女孩就是最美的，他无法撒谎。“没必要停留在某刻，你人生的任何阶段都会很美。”",
    goto: 64.53,
  },
  64.53: {
    type: "story",
    text: "女孩抱住了男孩，她明白了男孩的心意，她也想看看那时候的自己。",
    goto: 66,
  },
  65.1: {
    type: "story",
    text: "男孩停下了笔，他没有开口，他也不敢看女孩。",
    goto: 65.2,
  },
  65.2: {
    type: "story",
    text: "两人相互爱着彼此，毫无疑问在男孩眼中，女孩是最美的...",
    goto: 65.3,
  },
  65.3: {
    type: "story",
    text: "但在石岛上这是无法说出口的。",
    goto: 65.4,
  },
  65.4: {
    type: "story",
    text: "女孩突然抱住了男孩， 从沉默中她明白了男孩的心意。 ",
    goto: 65.5,
  },
  65.5: {
    type: "story",
    text: "她舍不得男孩，但她察觉那天愈发地临近。",
    goto: 66,
  },
  66: {
    type: "story",
    text: "“只要你自己选择不那么做，你完全可以..”",
    goto: 67,
  },
  67: {
    type: "story",
    text: "女孩赶忙打断了男孩的话，她四下查看没人，才责备男孩：",
    goto: 68,
  },
  68: {
    type: "story",
    text: "“这种话不能乱说。”",
    goto: 69,
  },
  69: {
    type: "story",
    text: "男孩长叹一口气。",
    goto: 70,
  },
  70: {
    type: "story",
    text: "几天后的傍晚，两人正在准备晚餐，屋外却有人群的说话声。十几个村民正聚在邻居的门口，等着看什么热闹。",
    goto: 71,
  },
  71: {
    type: "story",
    text: "男孩听到邻居屋里传出的声音，她正在发泄似的呼喊：“我不要变成石像！”",
    goto: 72,
  },
  72: {
    type: "story",
    text: "人群主动分开一条路，一个人从中走过，他走进屋。",
    goto: 73,
  },
  73: {
    type: "story",
    text: "十几分钟后邻居走了出来，她低着头很颓丧,但她愿意变成石像了。",
    goto: 74,
  },
  74: {
    type: "story",
    text: "男孩知道这是因为之前那人的劝导，岛上总有一个人专门干这个...但原则上所有人都是自愿变成石像的 ，所以人们并不承认有这个职位...",
    goto: 75,
  },
  75: {
    type: "story",
    text: "人们只称那个人为“村民”。",
    goto: 76,
  },
  76: {
    type: "story",
    text: "邻居换上了美丽的服装，她将穿着这身衣服化为石像。她离开了目送的人群，最后回望一眼，然后独自走向深山...",
    goto: 77,
  },
  77: {
    type: "option",
    text: "[A]跟上  [B]看着",
    options: [
      ["A", "跟上"],
      ["B", "看着"],
    ],
    goto: [77.1, 78.1],
  },
  77.1: {
    type: "story",
    text: "男孩想要跟上去向邻居说些安慰的话。但有人喝止：“忘了规矩吗？别人化石时不能去看!”",
    goto: 79,
  },
  78.1: {
    type: "story",
    text: "这时候应该有人去安慰她，但男孩无能为力。石岛上有个规矩，别人化石时不能去看。",
    goto: 79,
  },
  79: {
    type: "story",
    text: "直到第二天，男孩终于再次看到了邻居，她终究没能平静地离开，她脸上的不舍，如何也无法掩饰。",
    goto: 80,
  },
  80: {
    type: "story",
    text: "大部分人看了一眼就走了。这样的事每天都在发生，只要与自己无关，就没人会为此浪费一点感情。",
    goto: 81,
  },
  81: {
    type: "story",
    text: "只有男孩和女孩还留在这。女孩看着那张不舍的脸，仿佛看到了不久后的自己...",
    goto: 82,
  },
  82: {
    type: "story",
    text: "“她既失去的生命，又没能留下美丽。这样的结局，又有什么意义呢。 ”",
    goto: 83,
  },
  83: {
    type: "option",
    text: "[A]“…”  [B]“没有意义”",
    options: [
      ["A", "“…”"],
      ["B", "“没有意义”"],
    ],
    goto: [84, 84],
  },
  84: {
    type: "story",
    text: "男孩无法回答，他只能静静地陪在女孩身边。",
    goto: 85,
  },
  85: {
    type: "story",
    text: "一道声音在身后响起，是那个“村民”。",
    goto: 86,
  },
  86: {
    type: "story",
    text: "“你差不多也该化石了吧。看看身后那石像，她可比你还年轻。”",
    goto: 87,
  },
  87: {
    type: "story",
    text: "男孩握紧了拳头，女孩没有理会村民，拽着男孩离开了。",
    goto: 88,
  },
  88: {
    type: "story",
    text: "两人走在路上，男孩仍愤愤不平：“什么时候变成石像是自己说了算。”",
    goto: 89,
  },
  89: {
    type: "story",
    text: "“但他说的确实是事实。大家没有说，但我想他们都是这么想的。”",
    goto: 90,
  },
  90: {
    type: "story",
    text: "他们看向周围，人们的目光正有意无意往这边瞟。",
    goto: 91,
  },
  91: {
    type: "story",
    text: "女孩坐在悬崖边写着什么，男孩在一旁用画笔记录着女孩。女孩似乎写完了一段，她停下笔，看向男孩的画...男孩问女孩在写什么？",
    goto: 92,
  },
  92: {
    type: "story",
    text: "女孩说：“我想留下点东西，你的画，还有我正在写的那些以前发生过的美好的事，都是我存在的证明。”",
    goto: 93,
  },
  93: {
    type: "story",
    text: "她一脸严肃地盯着男孩：“以后不准去看我的石像，我肯定和其他人一样脸上全是恐惧和不舍，会很难看。”",
    goto: 94,
  },
  94: {
    type: "story",
    text: "“那我们可以不变石像，无论大家怎么说我们都不变。有一个人就是这样，她比你还大，但她仍没有。”",
    goto: 95,
  },
  95: {
    type: "story",
    text: "“我自认无法承受那样的压力。我既不够坚强也不够虔诚，我在这座岛上别无选择。”",
    goto: 96,
  },
  96: {
    type: "story",
    text: "男孩突然看向大海： “岛屿之外肯定还有其他陆地，我曾经在这看到过几艘陌生的船…”",
    goto: 97,
  },
  97: {
    type: "story",
    text: "男孩的话让女孩有些慌张：“谈论岛外是禁忌，你忘了那个被投海的人了吗。这要被别人听到...”",
    goto: 98,
  },
  98: {
    type: "story",
    text: "而就在此时，身后突然传来树枝折断声，还有远离的脚步。",
    goto: 99,
  },
  99: {
    type: "option",
    text: "[A]追上去  [B]也许他没听到",
    options: [
      ["A", "追上去"],
      ["B", "也许他没听到"],
    ],
    goto: [99.1, 100],
  },
  99.1: {
    type: "story",
    text: "男孩追上去，但只看到一个黑影，没能找到人。",
    goto: 100,
  },
  100: {
    type: "story",
    text: "他们只能相信对方没有听到那些话，不然也别无选择。",
    goto: 101,
  },
  101: {
    type: "story",
    text: "两人忐忑地回到村里， 至少身边的人都没说什么。时间平静地度过了几天，他们知道这平静是多么的脆弱。 ",
    goto: 102,
  },
  102: {
    type: "story",
    text: "女孩问：“岛外真的还有世界吗？”",
    goto: 103,
  },
  103: {
    type: "story",
    text: "“我坚信有，我看到的那些陌生的船，他们总得有停靠的地方吧。”",
    goto: 104,
  },
  104: {
    type: "story",
    text: "女孩好像有了一些憧憬：“你说他们也会像我们一样，在最美的时候变成石像吗。”",
    goto: 105,
  },
  105: {
    type: "story",
    text: "“他们不会。”",
    goto: 106,
  },
  106: {
    type: "story",
    text: "“为什么？”",
    goto: 107,
  },
  107: {
    type: "story",
    text: "“你问出这个问题时，就已经代表你希望得到否定的答案。”",
    goto: 108,
  },
  108: {
    type: "story",
    text: "这时，屋外传来了敲门声，两人有些惊慌..",
    goto: 109,
  },
  109: {
    type: "option",
    text: "[A]“是谁？”  [B]假装不在家",
    options: [
      ["A", "“是谁？”"],
      ["B", "假装不在家"],
    ],
    goto: [110.1, 111.1],
  },
  110.1: {
    type: "story",
    text: "询问来人，得知是村里的居民，她们语气和缓，男孩就开了门。",
    goto: 112,
  },
  111.1: {
    type: "story",
    text: "于是止住动作，假装屋里没人。",
    goto: 111.2,
  },
  111.2: {
    type: "story",
    text: "屋外有女人的交谈嬉闹声 ，不一会还有个女声喊： “有重要的事，快开门。”她们语气和缓，不似作假。从其他窗户观察屋外，也没看到有人埋伏.…..",
    goto: 111.3,
  },
  111.3: {
    type: "option",
    text: "[A]开门  [B]逃走",
    options: [
      ["A", "开门"],
      ["B", "逃走"],
    ],
    goto: [111.41, 111.51],
  },
  111.41: {
    type: "story",
    text: "男孩打开了门，发现都是岛上的熟面孔。",
    goto: 112,
  },
  111.51: {
    type: "story",
    text: "村民坐在屋中，有人进来通报...",
    goto: 111.52,
  },
  111.52: {
    type: "story",
    text: "村民说：“他们不是失踪了，他们是逃走了。”",
    goto: 111.53,
  },
  111.53: {
    type: "story",
    text: "“但石岛就这么大，他们又能逃去哪呢。”",
    goto: 111.54,
  },
  111.54: {
    type: "story",
    text: "正如村民所说，两人离开村子后就陷入了绝望，他们无处可逃。他们只能往那些人烟更稀少，更偏僻的地方藏..",
    goto: 111.55,
  },
  111.55: {
    type: "story",
    text: "两周后，有人向村民通报：“找到他们了。”",
    goto: 111.56,
  },
  111.56: {
    type: "story",
    text: "村民正欲欢呼，才察觉还有后话",
    goto: 111.57,
  },
  111.57: {
    type: "story",
    text: "“但是，他们都已经变成了石像。”",
    goto: 111.58,
  },
  111.58: {
    type: "story",
    text: "End 3 (BE/HE)",
    goto: "0",
  },
  112: {
    type: "story",
    text: "她们一进门，就开始拿着尺子在女孩身上量。问他们在做什么，他们说：“在为女孩准备化石时穿的衣服。”",
    goto: 113,
  },
  113: {
    type: "story",
    text: "“反正也就这几天，提前准备着吧。”",
    goto: 114,
  },
  114: {
    type: "story",
    text: "女孩本想把他们赶出去。但看到男孩表情平静，已经接受了一切，她长出的一点气焰都断了。",
    goto: 115,
  },
  115: {
    type: "story",
    text: "她突然跑了出去，直到晚上都没回来。",
    goto: 116,
  },
  116: {
    type: "story",
    text: "男孩在悬崖边找到了她。",
    goto: 117,
  },
  117: {
    type: "story",
    text: "“我想了很久，我果然还是不想变成石像!”",
    goto: 118,
  },
  118: {
    type: "story",
    text: "女孩终于下定了决心，她往悬崖下面看去。",
    goto: 119,
  },
  119: {
    type: "story",
    text: "“你要是真的爱我，我们一起跳下去吧!”",
    goto: 120,
  },
  120: {
    type: "option",
    text: "[A]“…”  [B]“不，我不能跳”",
    options: [
      ["A", "“…”"],
      ["B", "“不，我不能跳”"],
    ],
    goto: [121.1, 122],
  },
  121.1: {
    type: "story",
    text: "“现在不是沉默的时候!”",
    goto: 122,
  },

  122: {
    type: "story",
    text: "“不，我不能跳。”",
    goto: 123,
  },
  123: {
    type: "story",
    text: "男孩走下悬崖时村民与他错身而过。",
    goto: 124,
  },
  124: {
    type: "story",
    text: "“还以为能看到什么悲壮场面，到头来还是怕死。” ",
    goto: 125,
  },
  125: {
    type: "story",
    text: "女孩看着男孩离开，又看着村民走上来。",
    goto: 126,
  },
  126: {
    type: "story",
    text: "村民说：“相信我，每个人都会有这个时候，但她们最终都自愿化为了石像。",
    goto: 127,
  },
  127: {
    type: "story",
    text: "鲑鱼会在产卵后死去，秋天会有鸟群在岛上歇脚，海龟每年会上岸产卵。我们也一样，我们会在最美的时刻化为石像。”",
    goto: 128,
  },
  128: {
    type: "story",
    text: "“你指望靠这些说服我吗?”",
    goto: 129,
  },
  129: {
    type: "story",
    text: "“那我再多说一句。如果你要违背传统，那我就将男孩说的那些关于外面世界的话告诉所有人。”",
    goto: 130,
  },
  130: {
    type: "story",
    text: "。",
    goto: 131,
  },
  131: {
    type: "story",
    text: "。",
    goto: 132,
  },
  132: {
    type: "story",
    text: "。",
    goto: 133,
  },
  133: {
    type: "story",
    text: "“我答应你，请你原谅他，不要再向任何人提起那些话。”",
    goto: 134,
  },
  134: {
    type: "story",
    text: "####\n“这个故事就是这样，她最终还是妥协了。那时我就看着女孩穿着华丽的服装，走向了丛林。” ",
    goto: 135,
  },
  135: {
    type: "story",
    text: "你看向石像：“她比其他人都叛逆，但变成石像后她却笑得最美。”",
    goto: 136,
  },
  136: {
    type: "story",
    text: "姐姐说：“或许她不想男孩看到石像时感到难过吧。”",
    goto: 137,
  },
  137: {
    type: "story",
    text: "你想起什么，看向老阿婆：“你说见过化石的过程，不会就是这次吧？” ",
    goto: 138,
  },
  138: {
    type: "story",
    text: "老阿婆点头。",
    goto: 139,
  },
  139: {
    type: "story",
    text: "“灵魂被鱼带走，躯壳就会变成石像。”",
    goto: 140,
  },
  140: {
    type: "story",
    text: "老阿婆说完这句话，然后果然在你们脸上看到了难以置信的表情。她惆怅地说：“人们都不相信， 但那是我亲眼所见。 ",
    goto: 141,
  },
  141: {
    type: "story",
    text: "女孩化石那天，我等人散去之后， 晚上偷偷朝女孩离开的方向找了过去。",
    goto: 142,
  },
  142: {
    type: "story",
    text: "我第一眼看到的是这尊石像。 ",
    goto: 143,
  },
  143: {
    type: "story",
    text: "紧接着",
    goto: 144,
  },
  144: {
    type: "story",
    text: "我就看到了那条载着她灵魂驶向远方的鱼。”",
    goto: 144.1,
  },
  144.1: {
    type: "story",
    text: "晚霞已经落下，在悬崖下方，一艘渔船向着远方驶去。而那艘渔船，和我家中的那艘相比，虽然新很多，但是赫然是同一艘船。船上不多的几盏灯是浩瀚海洋上闪烁的小小光点，隐约能映出船上的两个人——男孩和女孩。他们目视远方，眼中充满憧憬与希望。",
    goto: 145,
  },
  145: {
    type: "story",
    text: "True End",
    goto: "end",
  },
  end: {
    type: "story",
    text: "Congratulations! You have completed the game!",
    goto: "0",
  },
};
